[
  {
    "job_id": "211",
    "job_title": "PRINCIPAL, CYBER PREVENT ENGINEER",
    "job_post_date": "2023-12-19T08:15:43+00:00",
    "job_short_description": "PRINCIPAL, CYBER PREVENT ENGINEER",
    "job_location": "Kenya (KE)",
    "job_link": "https://egjd.fa.us6.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/211"
  },
  {
    "job_id": "212",
    "job_title": "Lead – International Money Transfer",
    "job_post_date": "2023-12-19T09:32:23+00:00",
    "job_short_description": "We are pleased to announce the following vacancy Lead – International Money Transfer in Financial Services Cluster in Payments Tribe within Financial Services Division. In keeping with our current business needs, we are looking for a person who meets the criteria indicated below.\n",
    "job_location": "Safaricom House-Hq, Kenya (KE)",
    "job_link": "https://egjd.fa.us6.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/212"
  },
  {
    "job_id": "207",
    "job_title": "M-Pesa Africa - Evergreen Requisition Specialist – Cyber Security Prevent",
    "job_post_date": "2023-12-15T09:15:44+00:00",
    "job_short_description": "Reporting to Manager Cyber Security Prevent & Defense (M-Pesa Africa), the Specialist – Cyber Security Prevent, will be responsible for supporting L1 and L2 activities for Privilege Access Management Solution ranging from User Access issues, switchovers, patching and troubleshooting, being a SPOC in Cyber Security for one African Market and backup SPOC for another, assisting with remediation of vulnerabilities, patching and systems hardening, maintenance and support of various cybersecurity systems including (but not limited to) Firewalls, WAF, Antivirus, Logging Solutions, Network and Host IDS/IPS among other responsibilities\n",
    "job_location": "Nairobi, Kenya (KE)",
    "job_link": "https://egjd.fa.us6.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/207"
  },
  {
    "job_id": "203",
    "job_title": "M-Pesa Africa - Evergreen Requisition Manager Cyber Security Defense",
    "job_post_date": "2023-12-13T11:49:30+00:00",
    "job_short_description": "Cyber Defense is one of M-Pesa Africa’s critical Cyber Security teams. The manager Cyber Security Defense together with the cyber defense team are responsible for proactively identifying threats and vulnerabilities; detecting and mitigating cyber events; and managing cyber security incident responses to minimize service impact and provide a secure digital future for our customers. ",
    "job_location": "Nairobi, Kenya (KE)",
    "job_link": "https://egjd.fa.us6.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/203"
  }
]